Repository: PureBasicCN/PureBasicPreference
Catalog: OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Returns the MemoryAddress of the drawing buffer for direct pixel manipulation.
zh_cn: 返回用于直接操作绘图缓存的MemoryAddress。

source: Returns the OutputID of the given window to perform vector drawing operations.
zh_cn: 返回给定窗口的 OutputID 来执行矢量绘图操作。

source: Returns the address of the pixel data if direct access is possible or zero if the pixel data cannot be accessed directly.
zh_cn: 如果能直接访问像素数据则返回地址，否则返回零。

source: Returns the alpha component of a color value.
zh_cn: 返回一个颜色值的alpha分量.

source: Returns the blue component of a color value.
zh_cn: 翻译一个颜色值的蓝色负分量。

source: Returns the combined color.
zh_cn: 返回组合后的颜色.

source: Returns the date representing the parsed string.
zh_cn: 返回表示已解析字符串的日期.

source: Returns the date value expressing the given parameters, or the current system date if no parameters are specified.
zh_cn: 返回给定参数的日期值，如果没有指定参数，则返回当前系统日期.

source: Returns the day component of the specified date.
zh_cn: 返回指定日期的<日>.

source: Returns the day component.
zh_cn: 返回日期中的<日>.

source: Returns the error on the serial port when ReadSerialPortData(), WriteSerialPortData() or WriteSerialPortString() failed.
zh_cn: 当使用函数ReadSerialPortData()、 WriteSerialPortData()或WriteSerialPortString()失败时，在串口上返回的错误。

source: Returns the hour component of the date.
zh_cn: 返回日期的小时数.

source: Returns the hour value of the specified date.
zh_cn: 返回指定日期的小时数.

source: Returns the length in bytes of one line in the output, including any additional padding behind the pixel data of a line.
zh_cn: 返回以字节为单位的一行在输出中，包括任何额外填充后面一条线的像素数据的长度。

source: Returns the mask string with all tokens replaced by the date values.
zh_cn: 返回由日期值所替换的所有标记的掩码字符串（根据掩码格式显示日期）.

source: Returns the minute component of the date.
zh_cn: 返回日期的分钟数.

source: Returns the minute value of the specified date.
zh_cn: 返回指定日期的分钟数.

source: Returns the month component of the date.
zh_cn: 返回日期的月份.

source: Returns the month value of the specified date.
zh_cn: 返回指定日期的月份.

source: Returns the new date.
zh_cn: 返回一个被添加值后的新日期.

source: Returns the number of remaining bytes in the serial port input buffer.
zh_cn: 返回串行端口输入缓冲区中的剩余字节数.

source: Returns the number of remaining bytes in the serial port output buffer.
zh_cn: 返回串行端口输出缓冲区中的剩余字节数.

source: Returns the pixel format of the current output.
zh_cn: 返回当前输出的像素格式。

source: Returns the real length of one line of the current drawing buffer.
zh_cn: 返回当前绘图缓冲区的一条线的实际长度。

source: Returns the resulting 32-bit color from blending the two 32-bit colors.
zh_cn: 返回融合了两个32位的色彩所产生的32位色。

source: Returns the second component of the date.
zh_cn: 返回日期的<秒>数.

source: Returns the second value of the specified date.
zh_cn: 返回指定日期的<秒>数值.

source: Returns the specified date value.
zh_cn: 返回指定的日期值.

source: Returns the specified serial port status, according to the specified attribute.
zh_cn: 根据指定的属性，返回指定的串行端口状态.

source: Returns the specified serial port status.
zh_cn: 返回指定串口状态.

source: Returns the unique system identifier of the serial port.
zh_cn: 返回串行端口的系统唯一标识符。

source: Returns the value of the alpha component.
zh_cn: 返回alpha分量的值。

source: Returns the value of the blue component.
zh_cn: 返回值的蓝色分量.

source: Returns the weekday of the specified date.
zh_cn: 返回指定日期的工作日<星期几>.

source: Returns the width (in pixels) of the given window.
zh_cn: 返回给定窗口的宽度 （以像素为单位）。

source: Returns the x position (from the left) on the screen (in pixels) of the given window.
zh_cn: 返回的 x 位置 （从左至右） 在给定窗口的屏幕 （以像素为单位）。

source: Returns the x position on the screen of the given window.
zh_cn: 返回指定窗口的屏幕上的 x 位置。

source: Returns the y position (from the top) on the screen (in pixels) of the given window.
zh_cn: 返回的 y 位置 （从顶部开始） 从给定窗口的屏幕上 （以像素为单位）。

source: Returns the y position on the screen of the given window.
zh_cn: 返回指定窗口的屏幕上的 y 位置。

source: Returns the year component of the date.
zh_cn: 返回日期的年份.

source: Returns the year value of the specified date.
zh_cn: 返回指定日期的年份数.

source: Same as "Compile with Debugger" except that it forces the debugger to be off for this compilation.
zh_cn: 与“调试器编译”相似，但它强制不启用调试器对代码进行编译。

source: Save the currently active source to a different location than it was saved before.
zh_cn: 保存当前文件到与上次保存位置不同的另一个位置.

source: Saves all currently opened sources.
zh_cn: 保存所有当前打开源码。

source: Saves the currently active source to disk.
zh_cn: 将当前活动的源代码保存到磁盘。

source: Screenshots
zh_cn: 截图

source: Search
zh_cn: 搜索

source: See 'attribute' description to see which value is applicable.
zh_cn: 根据设定的 '属性' 描述以查看哪个值是适用的。

source: See Customizing the IDE for more information.
zh_cn: 点击 自定义 IDE了解更多详情。

source: See Also
zh_cn: 参阅

source: See the Auto complete section of Customizing the IDE for more information.
zh_cn: 你可以在配置开发环境 Customizing the IDE 中查看关于自动完成的更多信息。

source: Selecting a file in this submenu will open it again.
zh_cn: 在此子菜单中选择一个文件将它再次打开。

source: Selecting blocks of code:
zh_cn: 代码选择块：

source: Session history is a powerful tool which regularly records changes made to any files in a database.
zh_cn: 会话历史记录是一个强大的工具，定期记录到数据库中的任何文件所做的更改。

source: Set the default background color for graphic functions and text display.
zh_cn: 设置图形功能和文本显示的默认背景色。

source: Sets the drawing gradient to have a box shape.
zh_cn: 在方框中绘制渐变。

source: Sets the drawing gradient to have a circular shape.
zh_cn: 绘制一个渐变的圆。

source: Sets the drawing gradient to have a conical shape.
zh_cn: 设置绘图梯度为具有圆锥形状。

source: Sets the drawing gradient to have a custom shape, defined by the given callback procedure.
zh_cn: 设置绘图梯度有一个自定义形状，由给定的回调过程定义.

source: Sets the font to be used for text rendering on the current output.
zh_cn: 设置要用于对当前输出的文本呈现的字体。

source: Sets the number of stop bits (1, 1.5 or 2).
zh_cn: 设置停止位 （1、 1.5 或 2）。

source: Shows the changes made to the current source code compared to its version that exists on the hard drive.
zh_cn: 显示当前源码与硬盘中存在的另一版本之间的变化。

source: Similar to the special tab behavior above, the keyboard shortcuts Ctrl+E and Ctrl+Shift+E (CMD+E and CMD+Shift+E on OSX) can be used to change the indentation of only the comments in a selected block of code.
zh_cn: 类似于上面 Tab 的指定动作，使用键盘快捷方式 Ctrl + E，Ctrl + Shift + E （ OSX系统使用 CMD + E 和 CMD + Shift + E ） 可用于改变选定代码块注释的缩进。

source: Since ";" marks a comment in PB, these will be totally ignored by the compiler.
zh_cn: 以 ";" 开头表示为PB注释，这样在编译程序时会被编译器忽略。

source: Skip to content
zh_cn: 跳至内容

source: So by pressing the "Jump to Marker" shortcut (F2 by default) several times, you can jump to all the markers in the code.
zh_cn: 因此，通过多次按“跳转到标记”快捷键（默认F2），您可以跳转到代码中的所有书签标记。

source: So that you do not have to remember the exact name of every command, there is the Auto complete feature to make things easier.
zh_cn: 有自动完成功能，你就不必记住每一个命令的完整名称，使事情变得非常简单。

source: So the following information texts are short, but they include some "keywords" and links to further information, which are included in this reference manual.
zh_cn: 因此，以下信息是简短的，但在本参考手册中包括一些“关键词”和链接的详细信息。

source: Some basic knowledge about the terms used in this documentation will be needed, check Wikipedia - RS232 for more information.
zh_cn: 本文档中使用的一些关于RS232基本术语，请访问 Wikipedia - RS232 了解更多信息.

source: Sometimes a procedure need to call another procedure which isn't declared before its definition.
zh_cn: 有时一个程序需要调用另一个过程而不在其定义之前声明。

source: Source files included in a project can be scanned for AutoComplete even if they are not currently open in the IDE.
zh_cn: 即使有些文件没有在 IDE 中打开，IDE 依然会自动扫描项目中源代码文件及所包含资源。

source: Special Tab behavior:
zh_cn: 指定 Tab 动作：

source: Specifies a callback that will be called for every pixel that is part of a drawing operation in #PB_2DDrawing_CustomFilter drawing mode.
zh_cn: 指定将要求每个像素是在绘图操作的一部分回调＃PB_2DDrawing_CustomFilter绘图模式。.

source: Specifies the constant, in milliseconds, used to calculate the total time-out period for read operations.
zh_cn: 指定常量，以毫秒为单位，用来计算总超时期限的读取操作。

source: Specifies the constant, in milliseconds, used to calculate the total time-out period for write operations.
zh_cn: 指定常量，以毫秒为单位，用于计算写入操作总超时期限。

source: Specifies the maximum time, in milliseconds, which are allowed to elapse between the arrival of two characters on the communications line.
zh_cn: 指定的最长的时间，以毫秒为单位，两个字符在通信线路上允许到达的时间。

source: Specifies the multiplier, in milliseconds, used to calculate the total time-out period for read operations.
zh_cn: 指定乘数，以毫秒为单位，用来计算总超时期限的读取操作的乘数。

source: Specifies the multiplier, in milliseconds, used to calculate the total time-out period for write operations.
zh_cn: 指定乘数，以毫秒为单位，用于计算写入操作总超时期限的乘数。

source: Specifies the unit used for measuring distances on the drawing output.
zh_cn: 指定用于在绘图输出的测量距离的单位。

source: Support
zh_cn: 支持

source: Supported OS
zh_cn: 已支持操作系统

source: Syntax
zh_cn: 语法

source: Tab characters:
zh_cn: Tab 制表符：

source: Team Members
zh_cn: 团队成员

source: Tests if the given serial port is valid and correctly initialized.
zh_cn: 测试给定的串行端口是否有效和正确地初始化。

source: Text identifier for the serial port, for example "COM1" on Windows or "/dev/ttyS0" on Linux.
zh_cn: 串口识别符 ，例如在Windows系统是 "COM1" 或者 在Linux系统是 "/dev/ttyS0" .

source: Text is displayed with a solid background and graphic shapes are filled.
zh_cn: 与具有纯背景显示文本和填充图形形状的。

source: Thanks a lot for your support !
zh_cn: 非常感谢您的支持！

source: The "Add/Remove Marker" sets or removes a marker from the current line you are editing.
zh_cn: “添加/删除标记”将会新设定或删除正在编辑的当前行的书签标志。

source: The "Compile/Run" option respects the debugger setting (on or off) from the compiler options or debugger menu (they are the same).
zh_cn: 此“编译/运行”选项遵从编译器选项及调试器（启用或禁用）的调试器设置（他们设置相同）。

source: The "Find Next" button starts the search.
zh_cn: “查找下一个”按钮开始搜索。

source: The "Goto matching Keyword" menu entry described below can be used to quickly move between the matching keywords.
zh_cn: "转到匹配的关键字" 菜单项可以用于匹配关键字之间快速切换。

source: The "Include sub-directories" checkbox makes it search (recursively) inside any subdirectory of the given root directory too.
zh_cn: “包含子目录”复选框，会搜索指定目录下的所有子目录。

source: The "Insert" key controls whether text is inserted or overwritten.
zh_cn: "Insert" 键控制输入文本是插入或者覆盖模式。

source: The (x, y) coordinates are always absolute and not affected by calls to SetOrigin().
zh_cn: (x, y) 的坐标总是绝对的并且不受调用 SetOrigin()的影响。

source: The /NOEXT command is useful when you have several different PB versions at once (for testing of beta versions for example), but want the .pb extension to be associated with only one of them.
zh_cn: /NOEXT 命令在你 使用多个PB版本时非常有用 ( 比如在测试版中测试示例。) ，但希望.pb扩展只分配给其中之一。.

source: The /PORTABLE command can be used to keep all configuration inside the local directory to easily copy PureBasic to different computers (or run it from USB sticks for example).
zh_cn: /PORTABLE 命令可以用来保证所有配置在本地目录用来方便的拷贝PureBasic到其他的计算机 (或从U盘中运行示例).

source: The 2D drawing library contains all the 2D rendering operations that can be performed on a visual area.
zh_cn: 2D绘图库包含了所有在视觉区域执行2D渲染操作.

source: The RGBA() function can be used to create 32-bit colors with alpha transparency.
zh_cn: RGBA（）函数可用于创建32位的色与Alpha透明度。

source: The Plot() and Point() commands perform no bounds checking for performance reasons and therefore are also not affected by this command.
zh_cn: Plot() 和 Point() 命令因为执行无边界检查的性能原因，因此不影响此命令。

source: The Date library allows for the manipulation of Date and Time from 1970 up to 2038 using the Unix method (i.e. the number of seconds elapsed since the 1st of January 1970).
zh_cn: 日期类库允许对 自1970年到2038年的日期和时间进行操作，使用Unix的方法（即自1970年01月01日以来经过的秒数）.

source: The Delete key does a forward delete.
zh_cn: Delete 键用于删除后面文本内容。

source: The Edit Menu:
zh_cn: 编辑菜单：

source: The Find in Files Dialog lets you carry out a search inside many files in a specific directory.
zh_cn: 通过“在文件中查找”对话框您可以针对指定目录中的许多文件进行搜索查找。

source: The FontID can be easily obtained with the FontID() function from the font library.
zh_cn: FontID 可以用字体库的FontID()函数从简单的获得。

source: The ID of the image to draw.
zh_cn: 用来绘制的图像ID。

source: The IDE allows the editing of non-sourcecode text files.
zh_cn: IDE 允许编辑非源代码的文本文件。

source: The IDE can handle files in Ascii or UTF-8.
zh_cn: 开发环境能设定文件编码为Ascii或UTF-8。

source: The IDE comes with features to easily handle larger projects.
zh_cn: 该开发环境 IDE 具有轻松管理更大的项目的功能。

source: The IDE keeps track of the lines you view.
zh_cn: 开发环境 IDE 会返回到你浏览当前行前的代码行。

source: The IDE main window contains of 3 major parts:
zh_cn: IDE主窗口包括三个主要部分:

source: The PureBasic IDE
zh_cn: PureBasic IDE

source: The PureBasic IDE acts like any other Text Editor when it comes to the basic editing features.
zh_cn: PureBasic 集成开发环境（IDE） 用到的编辑功能如同任何其他的文本编辑器一样。

source: The PureBasic IDE allows you to create and edit your PureBasic source codes, as well as run them, debug them and create the final executable.
zh_cn: PureBasic IDE 允许你创建和编辑您的 PureBasic 源代码，以及允许他们，调试他们并且创建最终的可执行文件。

source: The PureBasic IDE allows you to modify the paths and files being used from the command-line.
zh_cn: PureBasic IDE允许你在命令行修改要使用的路径和文件.

source: The PureBasic source code has been programmed in a very modular fashion and can support any processor or operating system.
zh_cn: 所述的PureBasic源代码已经被编程以非常模块化的方式，可以支持任何处理器或操作系统。

source: The Serial port (also know as the RS-232 port) was first created in 1969, and despite its age, it is still widely used in the industry.
zh_cn: 串行端口 (也叫做 RS-232 端口) 第一次创建于 1969年， 尽管年代久远,，今天还仍然广泛地应用于工业领域。.

source: The SourceColor parameter specifies the color given in the drawing operation and the TargetColor parameter specifies the color of the target pixel in the drawing area.
zh_cn: 所述SourceColor参数指定在拉伸操作中给出的颜色和TargetColor参数指定在绘图区域中的目标像素的颜色。

source: The [-] will turn into a [+].
zh_cn: 当点击 [-]，则该部分代码会折叠起来，开头标志变成 [+]。

source: The address of a callback function to call.
zh_cn: 这是用来调用的回调函数的地址。

source: The address of a callback procedure to define the gradient.
zh_cn: 回调过程的地址来定义渐变。

source: The angle (in degrees) at which to start the gradient.
zh_cn: 在该角度（度）来开始渐变。

source: The angular factor vector.
zh_cn: 角系数向量。.

source: The attribute to set.
zh_cn: 要设置的属性。

source: The attribute value to set.
zh_cn: 要设置的属性值。

source: The background color is set with ConsoleColor().
zh_cn: 使用ConsoleColor()来设置背景色。

source: The behavior for further drawing operations.
zh_cn: 为进一步绘图操作行为。

source: The brace and keyword matching can be configured in the Preferences.
zh_cn: 括号和关键字匹配可以在配置中进行设置。

source: The buffer length to write, in bytes.
zh_cn: 要写入的缓冲区的长度，以字节为单位。

source: The buffer to write.
zh_cn: 要写入的缓冲区。

source: The callback has to calculate the color that the target pixel should have after the drawing and return that.
zh_cn: 回调必须计算目标像素应具有拉伸后该并返回的颜色。

source: The callback must have the following form:
zh_cn: 回调必须有如下形式：

source: The callback will be called for every pixel that is drawn as a result of a call to drawing functions like Line(), Box() or DrawText().
zh_cn: 回调将被称为对于每个被画成一个调用的结果绘制功能，如像素Line()，Box() 或DrawText()。

source: The center position of the conical gradient.
zh_cn: 锥形渐变的中心坐标。

source: The code is highly portable.
zh_cn: 代码高度可移植。

source: The color that will be in front.
zh_cn: 此颜色用于前景色.

source: The color that will be in the back.
zh_cn: 此颜色用于背景色.

source: The color to be used for the box.
zh_cn: 用于方框的颜色。

source: The color to be used for the characters.
zh_cn: 此颜色用于字符。

source: The color to be used for the circle.
zh_cn: 要用于该圆的颜色。

source: The color to be used for the line.
zh_cn: 要用于该行的颜色。

source: The color value.
zh_cn: 颜色值。

source: The color values range from 0 to 15, which are the 16 colors available in console mode:
zh_cn: 颜色范围在0-15,控制台模式下只有16种颜色有效:：

source: The column to use.
zh_cn: 要使用的列。

source: The compiler menu
zh_cn: 编译菜单

source: The components of the date to return.
zh_cn: 返回日期的组件.

source: The console can be closed using the CloseConsole() function.
zh_cn: 控制台关闭可以通过CloseConsole（）函数

source: The console has to be in graphical mode, see EnableGraphicalConsole().
zh_cn: 控制台必使用图形模式，请参考 EnableGraphicalConsole().

source: The console title is typically shown in the title bar of the window which the console is in (when you are viewing the console in a graphical environment such as your desktop).
zh_cn: 控制台标题通常显示在控制台为窗口的标题栏（当你在桌面的图形环境下查看控制台时）。

source: The console will automatically be closed when your program ends.
zh_cn: 您的程序结束后控制台窗口会自动关闭。

source: The coordinates are not affected by any calls to SetOrigin() or ClipOutput().
zh_cn: 此坐标不受调用 SetOrigin() 或 ClipOutput()的影响。

source: The current output is set with StartDrawing().
zh_cn: 开始绘制前使用 StartDrawing()设置当前输出。

source: The cursor keys as well as Page Up/Page Down, Home and End keys can be used to navigate through the code.
zh_cn: 光标键、上翻 / 下翻页键（Page Up/Page Down），Home 键和 End 键都用来编辑和浏览代码使用。

source: The database library is an easy set of functions to access SQLite, PostgreSQL or any database type (Oracle, MySQL, Access, etc) via ODBC.
zh_cn: 数据库函数库是一个简单设置函数来访问 SQLite, PostgreSQL 或者任何数据库类型(Oracle, MySQL, Access, 等等) via ODBC.

source: The database to use.
zh_cn: 要使用的数据库。

source: The date from which to extract the hour.
zh_cn: 需要被提取时间的日期.

source: The date from which to extract the minutes.
zh_cn: 需要被提取分钟的日期.

source: The date from which to extract the month.
zh_cn: 需要被提取月份的日期.

source: The date from which to extract the seconds.
zh_cn: 需要被提取<秒>的日期.

source: The date from which to extract the year.
zh_cn: 需要被提取<年份>的日期 .

source: The date value from which to extract the day.
zh_cn: 需要被提取值的日期.

source: The date value from which to extract the weekday.
zh_cn: 需要被提取值的日期.

source: The date value to use.
zh_cn: 需要格式化显示的日期值.

source: The date value to which the value should be added.
zh_cn: 需要被加时间的日期值.

source: The default files for /P /T and /A are saved in the %APPDATA%\PureBasic\ directory on the system.
zh_cn: /P /T 和 /A 的默认文件保存在系统的 %APPDATA%\PureBasic\ 目录.

source: The default shortcuts Ctrl+C (copy), Ctrl+X (cut) and Ctrl+V (paste) can be used for editing.
zh_cn: 默认的快捷键 Ctrl+C (复制)、 Ctrl+X (剪切) 和 Ctrl+V (粘贴) 用于代码编辑。

source: The default target is the one which is compiled/executed with the "Compile/Run" menu entry.
zh_cn: 默认的目标是用“编译/运行”菜单项编译/运行的一个目标。。

source: The default unit for windows is #PB_Unit_Pixel.
zh_cn: 窗口的默认单位是 #PB_Unit_Pixel.

source: The defaults for newly created source codes can be set in the preferences.
zh_cn: 新建源码文件的默认值可以在首选项中设置。

source: The details of this feature can be customized in the preferences.
zh_cn: 此功能的详细信息可以在 preferences 中定制。

source: The drawing origin is not modified by a call to this function.
zh_cn: 图形原点不被调用此功能修改。

source: The entity to use.
zh_cn: 使用该实体。

source: The event to bind.
zh_cn: 要绑定的事件。

source: The executable file is stored in a temporary location, but it will be executed with the current path set to the directory of the source code; so loading a file from the same directory as the source code will work.
zh_cn: 可执行文件存储在一个临时位置，但它会与源代码的目录作关联路径被执行；所以从源代码同一目录下加载文件将正常工作。

source: The experienced coder will have no problem in gaining access to any of the legal OS structures or API objects.
zh_cn: 经验丰富的程序员可以毫不费力的使用OS中的结构或API对象。

source: The external libraries are very optimized, up to the assembler level when needed, which produces very fast and small commands.
zh_cn: 外部库经过充分的优化，在必要时达到了汇编的水平，生成非常快且更少的指令。

source: The file menu allows you to do basic file operations like opening and saving source codes.
zh_cn: 文件菜单允许您做基本的文件操作，比如打开和保存源代码。

source: The filling mode is determined by DrawingMode().
zh_cn: 使用 DrawingMode()函数设置填充模式。

source: The find/replace dialog enables you to search for specific words in your code, and also to replace them with something else.
zh_cn: 查找/替换 对话框用于在你的代码中搜索指定的文本内容，并且可以用其它内容来替代它们。

source: The following examples show how to handle the result:
zh_cn: 下面的示例演示如何处理结果：

source: The following is an example for XOR'ed outlined shapes:
zh_cn: 以下是一个示例，因为 XOR'ed 空心形状：

source: The following tokens in the mask string will be replaced according to the given date:
zh_cn: 在掩码字符串中的下面的标记将根据给定的日期替换:

source: The following topics in this chapter should give you some ideas, where to start with PureBasic.
zh_cn: 本章中的下列主题，让你了解PureBasic编程应该是从哪里开始的。

source: The font to be used.
zh_cn: 要使用的字体。

source: The gradient only affects the drawing commands when #PB_2DDrawing_Gradient is set with the DrawingMode() command.
zh_cn: 当使用 DrawingMode() 设置了#PB_2DDrawing_Gradient时渐变只影响绘图命令。

source: The gradient ranges from the current background color at the center of the box to the current front color at the edges of the box.
zh_cn: 梯度从当前范围背景色在框的中心为当前前景色在框的边缘。

source: The gradient starts with the current background color at the given angle and then changes towards the current front color counterclockwise until the angle is reached again.
zh_cn: 使用指定的角度和背景颜色开始，然后开始使用前景色向逆时针方向的角度变化直到原来的起点。

source: The handshake mode.
zh_cn: 设置握手的模式。

source: The horizontal position in the console to move to (starting from 0)
zh_cn: 控制台中的水平位置(从0开始)。

source: The initial position of the window, in pixels (unless one of the center flags is used).
zh_cn: 窗口的初始位置，使用像素为单位（除非中心标志之一被使用）。

source: The key features of PureBasic are portability (Windows, Linux and MacOS X are currently supported), the production of very fast and highly optimized executables and, of course, the very simple BASIC syntax.
zh_cn: PureBasic 的主要特点是可移植性 （Windows、 Linux 和 MacOS X 目前均支持），生成非常快速和高度优化的可执行文件，当然，BASIC也语法非常简单。

source: The length to read from the serial port, in bytes.
zh_cn: 从串口读取数据的长度，以字节为单位。

source: The location at which to apply the current background color.
zh_cn: 在该位置应用当前背景颜色。

source: The location of the endpoint of the line.
zh_cn: 线的终点的位置。

source: The location of the gradient box.
zh_cn: 渐变框位置。

source: The location of the startpoint of the line.
zh_cn: 线的起点的位置。

source: The mask used to format the date.
zh_cn: 用于格式化日期的掩码.

source: The memory address to use to put the read data.
zh_cn: 读取数据的缓冲区。

source: The memory allocated in WindowVectorOutput() is released on StopVectorDrawing().
zh_cn: 在WindowVectorOutput()中分配的内存在StopVectorDrawing()函数中释放。

source: The menu commands are explained in the other sections.
zh_cn: 菜单命令在其他章节中解释。

source: The mode used to calculate the width of the window.
zh_cn: 用于计算窗口宽度的模式。

source: The mode used to calculate the x position of the window.
zh_cn: 用于计算窗口 x 位置的模式。

source: The mode used to calculate the y position of the window.
zh_cn: 此模式用于计算窗口的Y位置.

source: The new color to be used as the background color.
zh_cn: 被用作背景色的颜色。

source: The new height of the cursor indicator.
zh_cn: 光标的新高度。

source: The new window becomes the active window, it's not needed to use SetActiveWindow() (unless the window is created as invisible).
zh_cn: 新窗口是活动窗口, 不需要使用 SetActiveWindow() 设置为活动窗口(除非窗口创建的时候就不可见).

source: The newline formats it can handle are Windows (CRLF), Linux/Unix (LF) and MacOSX (CR).
zh_cn: 可以设定换行符制式为Windows(CRLF), Linux/Unix (LF)和MacOSX (CR)。

source: The next character is lost.
zh_cn: 下一个字符丢失。

source: The number of bytes which are actually read.
zh_cn: 实际读取的字节数，

source: The number of bytes written to the serial port, or zero if the operation has failed.
zh_cn: 返回写入串行端口的字节数，如果此操作失败，则返回 0 。

source: The number of remaining bytes in the serial port input buffer.
zh_cn: 串行端口输入缓冲区中的剩余字节数.

source: The number of remaining bytes in the serial port output buffer.
zh_cn: 串行端口输出缓冲区中的剩余字节数.

source: The object number to bind the event to.
zh_cn: 要绑定到该事件的对象数。

source: The output of the drawing functions is possible on a window, a screen, a sprite, an image or the printer.
zh_cn: T绘图函数可以输出到一个窗体, 一个屏幕, 一个画面, 一张图像, 一个纹理或者打印机上..

source: The place where this information is saved can be configured.
zh_cn: 可以对这个保存信息的地方进行设置。

source: The position and size of the box in the current drawing output.
zh_cn: 方框在当前绘制输出中的位置和大小。

source: The position and size of the clipping box.
zh_cn: 封闭区域的位置和大小。

source: The position of the center pixel of the circle.
zh_cn: 当前圆心的位置。

source: The position of the top/left corner of the image in the drawing output.
zh_cn: 绘制图片的位置，即左上角坐标位置。
